[
  {
    "slug": "yoga-back-health",
    "title": "Yoga for Back Health",
    "category": "flexibility-clinic",
    "duration_hours": 1.5,
    "cost": "$25",
    "description": "Join {staff} at ChiroStretch {location} for a gentle yoga session designed specifically to strengthen your back and improve spinal flexibility. This workshop combines targeted stretches with breathing techniques to help relieve tension and prevent future pain. Perfect for beginners and those with chronic back issues."
  },
  {
    "slug": "stress-relief-relaxation",
    "title": "Stress Relief & Relaxation Workshop",
    "category": "stretch-training",
    "duration_hours": 1,
    "cost": "$20",
    "description": "Discover practical techniques for managing stress and promoting relaxation at ChiroStretch {location}. Led by {staff}, this workshop covers breathing exercises, gentle stretching, and mindfulness practices you can use daily. Leave feeling refreshed and equipped with tools for lasting calm."
  },
  {
    "slug": "posture-correction",
    "title": "Posture Correction Workshop",
    "category": "posture-alignment",
    "duration_hours": 1.5,
    "cost": "$30",
    "description": "Poor posture affects millions of Americans, leading to pain and reduced mobility. At ChiroStretch {location}, {staff} will guide you through posture assessment, corrective exercises, and ergonomic tips. Take home a personalized plan to stand taller and feel better."
  },
  {
    "slug": "office-worker-stretching",
    "title": "Stretching for Office Workers",
    "category": "corporate-wellness",
    "duration_hours": 1,
    "cost": "$15",
    "description": "Designed for those who spend hours at a desk, this workshop at ChiroStretch {location} teaches you stretches you can do at your workstation. {staff} demonstrates techniques to counteract the effects of prolonged sitting, targeting the neck, shoulders, and lower back."
  },
  {
    "slug": "mobility-flexibility",
    "title": "Mobility & Flexibility Fundamentals",
    "category": "mobility-workshop",
    "duration_hours": 1.5,
    "cost": "$25",
    "description": "Whether you're an athlete or simply want to move better, this workshop at ChiroStretch {location} covers the essentials. {staff} leads you through dynamic stretches, foam rolling techniques, and mobility drills that you can incorporate into your daily routine."
  },
  {
    "slug": "understanding-back-pain",
    "title": "Understanding Back Pain Seminar",
    "category": "back-pain-relief",
    "duration_hours": 1,
    "cost": "Free",
    "description": "Learn what causes back pain and how to address it at this free educational seminar at ChiroStretch {location}. {staff} explains common conditions, treatment options, and preventive measures. Q&A session included. Refreshments provided."
  },
  {
    "slug": "nutrition-joint-health",
    "title": "Nutrition for Joint Health",
    "category": "chiropractic-education",
    "duration_hours": 1,
    "cost": "Free",
    "description": "What you eat affects how you feel. At ChiroStretch {location}, {staff} discusses the connection between diet and joint health, including anti-inflammatory foods, supplements, and hydration. Walk away with practical dietary tips for healthier joints."
  },
  {
    "slug": "sleep-spinal-health",
    "title": "Sleep & Spinal Health Seminar",
    "category": "spine-health",
    "duration_hours": 1,
    "cost": "Free",
    "description": "Quality sleep is essential for spinal recovery and overall wellness. Join {staff} at ChiroStretch {location} to learn about optimal sleeping positions, pillow selection, and mattress recommendations. Improve your rest and wake up pain-free."
  },
  {
    "slug": "ergonomics-at-work",
    "title": "Workplace Ergonomics Seminar",
    "category": "corporate-wellness",
    "duration_hours": 1,
    "cost": "Free",
    "description": "Your workspace setup matters. At ChiroStretch {location}, {staff} covers proper desk setup, monitor positioning, and seated posture. Bring photos of your workspace for personalized feedback. Ideal for remote workers and office employees alike."
  },
  {
    "slug": "preventing-sports-injuries",
    "title": "Sports Injury Prevention Seminar",
    "category": "athletic-recovery",
    "duration_hours": 1.5,
    "cost": "Free",
    "description": "Athletes of all levels can benefit from this seminar at ChiroStretch {location}. {staff} covers warm-up routines, common injury patterns, and recovery strategies. Learn how to train smarter and stay in the game longer."
  },
  {
    "slug": "open-house",
    "title": "Open House & Free Consultations",
    "category": "community-event",
    "duration_hours": 3,
    "cost": "Free",
    "description": "Experience ChiroStretch {location} at our open house event! Meet our team including {staff}, tour the facility, and enjoy complimentary consultations. Refreshments served. Special offers available for new patients who sign up during the event."
  },
  {
    "slug": "community-wellness-day",
    "title": "Community Wellness Day",
    "category": "community-event",
    "duration_hours": 4,
    "cost": "Free",
    "description": "ChiroStretch {location} invites the community to a day of wellness activities! Free spinal screenings, mini-workshops, healthy snacks, and giveaways. {staff} and the entire team look forward to meeting you and your family."
  },
  {
    "slug": "member-appreciation",
    "title": "Member Appreciation Event",
    "category": "community-event",
    "duration_hours": 2,
    "cost": "Free",
    "description": "We're saying thank you to our valued patients at ChiroStretch {location}! Join {staff} and the team for refreshments, door prizes, and exclusive member discounts. Bring a friend and they'll receive a free first consultation."
  },
  {
    "slug": "wellness-challenge-kickoff",
    "title": "30-Day Wellness Challenge Kickoff",
    "category": "community-event",
    "duration_hours": 1.5,
    "cost": "Free",
    "description": "Start your wellness journey at ChiroStretch {location}! {staff} launches our 30-day challenge with goal setting, baseline assessments, and team formation. Weekly check-ins and prizes for top participants. Registration required."
  },
  {
    "slug": "health-fair",
    "title": "Community Health Fair",
    "category": "community-event",
    "duration_hours": 4,
    "cost": "Free",
    "description": "ChiroStretch {location} hosts local health providers for an afternoon of wellness education. Free screenings, demonstrations, and vendor booths. {staff} will be on hand for spinal assessments. Family-friendly event with activities for kids."
  },
  {
    "slug": "sports-recovery-clinic",
    "title": "Sports Recovery Clinic",
    "category": "athletic-recovery",
    "duration_hours": 2,
    "cost": "$45",
    "description": "Push your limits, recover smarter. At ChiroStretch {location}, {staff} leads this specialized clinic covering post-workout recovery, soft tissue techniques, and injury rehabilitation. Ideal for runners, CrossFitters, and weekend warriors."
  },
  {
    "slug": "prenatal-wellness",
    "title": "Prenatal Wellness Session",
    "category": "spine-health",
    "duration_hours": 1.5,
    "cost": "$35",
    "description": "Pregnancy brings unique physical challenges. At ChiroStretch {location}, {staff} provides gentle care tailored for expecting mothers. Learn safe stretches, optimal positions for comfort, and prepare your body for a healthy delivery."
  },
  {
    "slug": "senior-mobility-clinic",
    "title": "Senior Mobility Clinic",
    "category": "flexibility-clinic",
    "duration_hours": 1.5,
    "cost": "$25",
    "description": "Maintain your independence with better mobility. ChiroStretch {location} welcomes seniors to this specialized session with {staff}, focusing on balance, flexibility, and fall prevention. Gentle exercises suitable for all fitness levels."
  },
  {
    "slug": "youth-athlete-assessment",
    "title": "Youth Athlete Assessment Day",
    "category": "athletic-recovery",
    "duration_hours": 2,
    "cost": "$40",
    "description": "Give your young athlete an edge at ChiroStretch {location}. {staff} provides comprehensive movement assessments, identifies potential issues, and offers training recommendations. Perfect for student-athletes ages 10-18."
  },
  {
    "slug": "headache-migraine-relief",
    "title": "Headache & Migraine Relief Clinic",
    "category": "back-pain-relief",
    "duration_hours": 1.5,
    "cost": "$35",
    "description": "Find relief from chronic headaches and migraines at ChiroStretch {location}. {staff} explains the connection between spinal alignment and head pain, demonstrates self-care techniques, and offers personalized treatment recommendations."
  }
]
